Revit 2027 API
RevitCommandId.LookupCommandId Method
 Looks up and retrieves the Revit command id with the given id string.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RevitCommandId LookupCommandId(
	string name
)
Public Shared Function LookupCommandId (
	name As String
) As RevitCommandId
public:
static RevitCommandId^ LookupCommandId(
	String^ name
)
static member LookupCommandId :
        name : string -> RevitCommandId
Parameters
name String
 he Revit command name. Refer to the entries in the Revit journal to find the string to use for a particular command.
Return Value
RevitCommandId
 The Revit command id. Returning "null" if a command with the given name was not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevitCommandId Class
Autodesk.Revit.UI Namespace